Repository: carlosfelipespinola/flashcards
Catalog: lib/l10n/app_*.arb
Languages: es, pt

source: Back side
es: Lado trasero
pt: Verso

source: Cancel
es: Cancelar
pt: Cancelar

source: Categories
es: Categorías
pt: Categorias

source: Category
es: Categoría
pt: Categoria

source: Category name
es: Nombre de la categoría
pt: Nome da categoria

source: Close
es: Cerrar
pt: Fechar

source: Confirm
es: Confirmar
pt: Confirmar

source: Create category
es: Crear categoría
pt: Criar categoria

source: Create flashcard
es: Crear flashcard
pt: Criar flashcard

# createFlashcardSuccessMessage
source: Flashcard successfully created
es: Flashcard registrado con éxito
pt: Flashcard cadastrado com sucesso

source: Dark mode
es: Modo oscuro
pt: Modo escuro

# defaultErrorMessage
source: Something went wrong.
es: Algo salió mal.
pt: Algo deu errado.

source: Delete
es: Eliminar
pt: Deletar

# deleteCategoryConfirmMessage
source: Are you sure about deleting the following category: {category}?
es: ¿Está seguro de que desea eliminar la categoría: {category}?
pt: Você tem certeza que deseja deletar a categoria: {category}?

# deleteCategoryErrorMessage
source: Something went wrong while deleting the following category: '{category}'.
es: Algo salió mal al eliminar la siguiente categoría: '{category}'.
pt: Ocorreu um erro ao deletar a categoria '{category}'.

# deleteCategorySuccessMessage
source: The category '{category}' was successfully deleted.
es: La categoría '{category}' fue eliminada.
pt: Categoria '{category}' deletada com secesso

# deleteFlashcardConfirmMessage
source: Are you sure about deleting this flashcard?
es: ¿Está seguro de que desea eliminar este flashcard?
pt: Você tem certeza que deseja deletar este flashcard?

# deleteFlashcardSuccessMessage
source: Flashcard successfully deleted
es: Flashcard eliminado con éxito
pt: Flashcard deletado com sucesso

source: Edit
es: Editar
pt: Editar

source: Finish
es: Finalizar
pt: Finalizar

# flashcardsQuantity
source: Number of flashcards
es: Número de flashcards
pt: Quantidade de flashcards

source: Front side
es: Lado frontal
pt: Frente

# lessonGenerationErrorMessage
source: Something went wrong while choosing flashcards to practice
es: Algo salió mal al elegir flashcards para practicar
pt: Ocorreu um erro ao filtrar flashcards para prática, tente novamente

source: Manage categories
es: Administrar categorías
pt: Gerenciar categorias

source: Next step
es: Proximo paso
pt: Próximo passo

# noCategoryRegisteredMessage
source: There are no registered categories
es: Ninguna categoría registrada
pt: Nenhuma categoria foi registrada ainda

# noFlashcardCreatedMessage
source: You haven't created a flashcard yet
es: Aún no has creado un flashcard
pt: Você ainda não criou um flashcard

# noFlashcardForSearchMessage
source: No flashcards found for your search
es: No se encontraron flashcards para su búsqueda
pt: Nenhum flashcard encontrado para sua pesquisa

# noFlashcardsFoundMessage
source: No flashcards found
es: No se encontraron flashcards
pt: Nenhum flashcard foi encontrado

source: Open source licenses
es: Licencias de código abierto
pt: Licenças de código aberto

source: Practice
es: Practicar
pt: Praticar

# practiceNeedsFlashcardsMessage
source: It's not possible to practice because you don't have flashcards registered yet
es: No es posible practicar porque aún no tienes flashcards registrados.
pt: Não é possível praticar porque você ainda não tem flashcards cadastrados

source: Proficiency
es: Dominio
pt: Domínio

source: Save
es: Guardar
pt: Salvar

source: Search flashcard
es: Buscar flashcard
pt: Pesquisar flashcard

# selectCategory
source: Select a category
es: Seleccione una categoría
pt: Selecione uma categoria

source: Settings
es: Ajustes
pt: Configurações

source: Show all
es: Mostrar todo
pt: Mostrar todos

source: Start
es: Comenzar
pt: Começar

source: Try again
es: Intentar nuevamente
pt: Tentar novamente

# typeNumberBetween
source: Enter a number between {min} and {max}
es: Introduzca un número entre {min} y {max}
pt: Digite um número entre {min} e {max}

source: Uncategorized
es: Sin categoría
pt: Sem categoria

source: Update flashcard
es: Actualizar flashcard
pt: Atualizar flashcard

# updateFlashcardSuccessMessage
source: Flashcard successfully updated
es: Flashcard actualizado con éxito
pt: Flashcard atualizado com sucesso

# exportFlashcardsTitle
source: Export flashcards
es: Exportar flashcards
pt: Exportar flashcards

# exportFlashcardsExplanationMessage
source: During the flashcards export process you will be asked to create a file somewhere in your device's storage in which the data will be saved.
es: Durante el proceso de exportación de las flashcards se te pedirá que crees un archivo en algún lugar del almacenamiento de tu dispositivo en el que se guardarán los datos.
pt: Durante o processo de exportação de flashcards será solicitado que você crie um arquivo em algum lugar do armazenamento do seu dispositivo no qual os dados serão salvos.

# exportFlashcardActionText
source: Export
es: Exportar
pt: Exportar

# exportFlashcardInProgressTitle
source: Export in progress
es: Exportación en curso
pt: Exportação em progresso

# exportFlashcardsErrorTitle
source: Flashcards exportation failed
es: Error al exportar flashcards
pt: Falha ao exportar flashcards

# exportFlashcardsUserCanceledErrorMessage
source: Flashcards was not exported because the backup file where the data would be saved was not created
es: Las Flashcards no se exportaron porque no se creó el archivo de copia de seguridad donde se guardarían los datos.
pt: Os flashcards não foram exportados, pois o arquivo de backup solicitado durante o processo não foi criado.

# exportFlashcardsInvalidBackupLocationErrorMessage
source: Make sure the file you have selected to export the data to still exists
es: Asegúrese de que el archivo seleccionado para exportar los datos sigue existiendo.
pt: Certifique-se de que o arquivo que você escolheu para salvar os dados ainda existe

# exportFlashcardsFinishedTitle
source: Exportation finished
es: Exportación finalizada
pt: Exportação finalizada

# exportFlashcardsFinishedMessage
source: All flashcards were successfully exported.
es: Todos los flashcards se han exportado correctamente.
pt: Todos os flashcards foram exportados com sucesso.

# importFlashcardsTitle
source: Import flashcards
es: Importar flashcards
pt: Importar flashcards

# importFlashcardsResetProgressQuestion
source: Reset learning progress?
es: Reiniciar el progreso de aprendizaje?
pt: Resetar progresso de aprendizado?

# importFlashcardsResetProgressAdvice
source: It is recommended to enable this option if you are importing flashcards exported by someone else
es: Se recomienda activar esta opción si va a importar flashcards exportadas por otra persona.
pt: É recomendado ativar essa opção se você estiver importando flashcards que foram exportados por outra pessoa

# importFlashcardsActionText
source: Pick file and import
es: Elegir archivo e importar
pt: Escolher arquivo e importar

# importFlashcardsErrorTitle
source: Flashcards importation failed
es: Error al importar flashcards
pt: Falha ao importar flashcards

# importFlashcardsUserCanceledErrorMessage
source: Unable to import data because no backup file was selected
es: No se pueden importar datos porque no se ha seleccionado ningún archivo de copia de seguridad.
pt: Não foi possível importar flashcards, pois nenhum arquivo de backup foi escolhido

# importFlashcardsInvalidBackupLocationErrorMessage
source: Make sure the file you selected still exists
es: Asegúrese de que el archivo seleccionado para exportar los datos sigue existiendo.
pt: Certifique-se de que o arquivo que você escolheu ainda existe

# importFlashcardsCorruptedDataErrorMessage
source: The data that you have selected to restore is corrupted or is not recognized by this app
es: Los datos que ha seleccionado para restaurar están dañados o no son reconocidos por esta aplicación
pt: Os dados que você escolheu para restaurar estão corrompidos ou não são reconhecidos por este aplicativo

# importFlashcardsInProgressTitle
source: Importation in progress
es: Importación en curso
pt: Importação em progresso

# importFlashcardsWarningMessage
source: Do not close the app while importing flashcards
es: No cierres la aplicación mientras importas las flashcards
pt: Não feche o aplicativo enquanto a importação estiver em progresso

# importFlashcardsProgressTracker
source: Importing {current} of {max} flashcards
es: Importando {current} de {max} flashcards
pt: Importando {current} de {max} flashcards

# importFlashcardsFinishedTitle
source: Importation finished
es: Importación finalizada
pt: Importação finalizada

source: Imported flashcards
es: Flashcards importados
pt: Flashcards importados

# duplicatedFlashcards
source: Skipped Duplicated flashcards
es: Flashcards duplicados omitidos
pt: Flashcards duplicados ignorados

# importErrors
source: Errors
es: Errores
pt: Erros

source: Processed flashcards
es: Flashcards Procesados
pt: Flashcards processados
